package task;

public class Collection {
    public static void main(String[] args) {


    }

    // Реализуйте функциональность согласно описанию

    // TODO: Для каждой задачи сгенерируйте самостоятельно коллекции и карты для тестирования своих методов

    // TODO: Найти наибольший элемент в списке.

    // TODO: Удалить все дубликаты из списка.

    // TODO: Отсортировать список в порядке убывания.

    // TODO: Проверить, содержит ли множество определенный элемент.

    // TODO: Найти пересечение двух множеств.

    // TODO: Удалить все элементы из множества, которые также содержатся в другом множестве.

    // TODO: Проверить, содержит ли карта определенный ключ.

    // TODO: Получить все значения, связанные с определенным ключом.

    // TODO: Удалить все записи из карты, у которых значение равно определенному значению.

    // TODO: Добавить элемент в очередь.

    // TODO: Получить и удалить первый элемент из очереди.

    // TODO: Проверить, пуста ли очередь.
}